; domain
(define (domain spanner)
(:requirements :strips :typing :negative-preconditions)
(:types
location T1 - object
nut spanner man - T1
)
(:predicates
	(at ?x1 - T1 ?x2 - location)
	(carrying ?x1 - man ?x2 - spanner)
	(useable ?x1 - spanner)
	(loose ?x1 - nut)
	(tightened ?x1 - nut)
	(link ?x1 - location ?x2 - location)
)
(:action walk
	:parameters (?x1 - location ?x2 - location ?x3 - man )
	:precondition (and
	(at ?x3 ?x1)
	(link ?x1 ?x2)
	(not(at ?x3 ?x2)))
	:effect (and
	(not(at ?x3 ?x1))
	(at ?x3 ?x2))
)
(:action pickup_spanner
	:parameters (?x1 - location ?x2 - spanner ?x3 - man )
	:precondition (and
	(at ?x3 ?x1)
	(at ?x2 ?x1)
	(not(carrying ?x3 ?x2))
	(useable ?x2))
	:effect (and
	(not(at ?x2 ?x1))
	(carrying ?x3 ?x2))
)
(:action tighten_nut
	:parameters (?x1 - location ?x2 - spanner ?x3 - man ?x4 - nut )
	:precondition (and
	(at ?x3 ?x1)
	(carrying ?x3 ?x2)
	(loose ?x4)
	(at ?x4 ?x1)
	(useable ?x2)
	(not(tightened ?x4)))
	:effect (and
	(not(loose ?x4))
	(not(useable ?x2))
	(tightened ?x4))
)
)

; problem
(define (problem instance5) (:domain spanner) (:objects
     bob - man
 spanner1 spanner2 spanner3 - spanner
     nut1 nut2 - nut
     location1 location2 location3 - location
     shed gate - location
    ) (:init
    (at bob shed)
    (at spanner1 location1)
    (useable spanner1)
    (at spanner2 location2)
    (useable spanner2)
    (at spanner3 location1)
    (useable spanner3)
    (loose nut1)
    (at nut1 gate)
    (loose nut2)
    (at nut2 gate)
    (link shed location1)
    (link location1 shed)
    (link location1 location2)
    (link location2 location1)
    (link location2 location3)
    (link location3 location2)
    (link location3 gate)
    (link gate location3)
) (:goal
  (and
   (tightened nut1)
   (tightened nut2)
)))

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 2
2. (pickup_spanner location1 spanner3 bob)
   deleted: (at spanner3 location1)
   added: (carrying bob spanner3)
   goals met: 0 of 2
3. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 2
4. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 2
5. (walk location3 gate bob)
   deleted: (at bob location3)
   added: (at bob gate)
   goals met: 0 of 2
6. (tighten_nut gate spanner3 bob nut1)
   deleted: (loose nut1) (useable spanner3)
   added: (tightened nut1)
   goals met: 1 of 2
7. (walk gate location3 bob)
   deleted: (at bob gate)
   added: (at bob location3)
   goals met: 1 of 2
8. (walk location3 location2 bob)
   deleted: (at bob location3)
   added: (at bob location2)
   goals met: 1 of 2
9. (pickup_spanner location2 spanner2 bob)
   deleted: (at spanner2 location2)
   added: (carrying bob spanner2)
   goals met: 1 of 2
10. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 1 of 2
11. (walk location3 gate bob)
   deleted: (at bob location3)
   added: (at bob gate)
   goals met: 1 of 2
12. (tighten_nut gate spanner2 bob nut2)
   deleted: (loose nut2) (useable spanner2)
   added: (tightened nut2)
   goals met: 2 of 2
